<html>
  <head>
    <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
    <link rel="stylesheet" href="../../help.css" type="text/css">
    
  </head>
  <body>
    <img src="../logo-editor.png" style="margin-left: 10px; margin-bottom: 10px; display: block; margin-right: 10px; margin-top: 10px" alt="TEST IMAGE fail!">
    

    <h1>
      Tipo de perfil
    </h1>
    <p>
      Debido a que se permite exportar en distintos est&#225;ndares de e-learning, 
      existen distintos perfiles de evaluaci&#243;n y adaptaci&#243;n. La elecci&#243;n del 
      perfil est&#225; relacionada con el modelo de datos existente en el LMS 
      utilizado, haciendo las pertinentes restricciones sobre el mismo. A d&#237;a 
      de hoy, podemos encontrar tres tipos:
    </p>
    <ol>
      <li>
        <b>Perfil normal</b>

        <p>
          En este tipo de perfil no encuentra limitaci&#243;n ninguna sobre el 
          modelo de datos del LMS y se utiliza para aquellos est&#225;ndares que no 
          poseen modelo de datos espec&#237;fico (como Learning Design).
        </p>
      </li>
      <li>
        <b>Perfil SCORM 1.2</b>

        <p>
          Limita el modelo de datos para el est&#225;ndar SCORM 1.2 (m&#225;s 
          informaci&#243;n en: http://www.adlnet.gov/). Cuando se decidan modificar 
          o consultar propiedades del LMS con motivo de que se haya cumplido 
          una regla de evaluaci&#243;n o adaptaci&#243;n, solo nos permitir&#225; elegir 
          entre las partes del modelo de datos SCORM 1.2 que son de escritura 
          o lectura, seg&#250;n el perfil. De esta manera se impide almacenar o 
          consultar valores en partes del modelo de datos que son s&#243;lo de 
          lectura o s&#243;lo de escritura respectivamente, a la vez que abstrae el 
          conocimiento exacto de dicho modelo de datos. Si deseamos exportar 
          como SCORM 1.2, y tenemos perfiles de evaluaci&#243;n y/o adaptaci&#243;n 
          asignados a cualquiera de los cap&#237;tulos, ser&#225; requerido que dichos 
          perfiles sean de este tipo.
        </p>
      </li>
      <li>
        <b>Perfil SCORM 2004</b>

        <p>
          Act&#250;a de manera id&#233;ntica que para el est&#225;ndar SCORM 1.2, pero para 
          el modelo de datos del est&#225;ndar SCORM 2004 (m&#225;s informaci&#243;n en: 
          http://www.adlnet.gov/) . Si deseamos exportar como SCORM 2004 o 
          como AGREGA (los juegos exportados a AGREGA utilizan SCORM 2004), y 
          tenemos perfiles de evaluaci&#243;n y/o adaptaci&#243;n asignados a cualquiera 
          de los cap&#237;tulos, ser&#225; requerido que dichos perfiles sean de este 
          tipo.
        </p>
      </li>
    </ol>
  </body>
</html>
