<html>
  <head>
    <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
    <link rel="stylesheet" href="../../help.css" type="text/css">
    
  </head>
  <body>
    <img src="../logo-editor.png" style="margin-left: 10px; margin-bottom: 10px; display: block; margin-right: 10px; margin-top: 10px" alt="TEST IMAGE fail!">
    

    <h1>
      Escena: Apariencia
    </h1>
    <p>
      En este panel se configura la apariencia de la escena, en particular de 
      su fondo.
    </p>
    <h2>
      Imagen del fondo de la escena
    </h2>
    <p>
      <b>Obligatoria</b>
    </p>
    <p>
      Esta es la imagen que se ve en el fondo de la escena. La imagen debe de 
      tener un tama&#241;o m&#237;nimo de 800x600 y se recomienda que la altura no 
      supere dicha los 600.
    </p>
    <h2>
      M&#225;scara frontal de la escena
    </h2>
    <p>
      <b>Opcional</b>
    </p>
    <p>
      Consiste en una imagen en blanco y negro que nos indica qu&#233; parte de la 
      imagen del fondo debe dibujarse detr&#225;s de objetos, personajes y jugador 
      y cu&#225;l debe pintarse delante. A continuaci&#243;n se muestra una imagen de 
      fondo y cual ser&#237;a su m&#225;scara frontal: 
   <br/>
    <img src="Scene_Appearence_files/mask.jpg" style="margin-left: 10px; margin-bottom: 10px; display: block; margin-right: 10px; margin-top: 10px" alt="Ejemplo de uso de m‡scara frontal">
    <br/>
      Como puede apreciarse, la imagen corresponde a una clase. Lo l&#243;gico es 
      que tal como est&#225; tomada la imagen, los personajes se sit&#250;en justo 
      delante de la pizarra pero detr&#225;s de los pupitres. Por tanto la m&#225;scara 
      ser&#225; una imagen en la que los pupitres (primer plano) est&#225;n en negro y 
      lo dem&#225;s en blanco.
    </p>
    <p>
      Las m&#225;scaras frontales en &lt;e-Adventure&gt; comienzan a estar en desuso por 
      la complejidad de uso y limitaciones que presentan. Como m&#225;s adelante se 
      describe, este comportamiento puede conseguirse (y de forma mucho m&#225;s 
      refinada) combinando <i>capas</i> y <i>objetos de atrezo</i>.
    </p>
    <h2>
      M&#250;sica de fondo
    </h2>
    <p>
      <b>Opcional</b>
    </p>
    <p>
      M&#250;sica de fondo de la escena, que sonar&#225; c&#237;clicamente mientras la escena 
      est&#233; en pantalla. Pistas de audio en formato MP3 o MIDI son aceptadas.
    </p>
    <h3>
      Ver tambi&#233;n
    </h3>
    <p>
      <a href="../general/Appearence.html">Explicaci&#243;n general del uso de 
      apariencias.</a>
    </p>
  </body>
</html>
