<html>
<head>
<title>Efecto mostrar texto</title>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
<link href="../../help.css" type="text/css" rel="stylesheet">
</head>
<body>
<img src="../logo-editor.png" alt="TEST IMAGE fail!"
	style="display: block; margin: 10px" />
<h1>Efecto Mostrar Texto</h1>
<p>Mediante este efecto se muestra texto en la pantalla, de igual
manera que en las conversaciones. Pero a diferencia de ellas, el texto
no est&aacute; asociado a ning&uacute;n personaje ni al protagonista.</p>
<p>Crear un efecto mostrar texto:</p>
<ul>
	<li><b>Seleccionar el efecto: </b>seleccionar el efecto en el
	panel de creaci&oacute;n de efectos. Pulsar el bot&oacute;n OK.</li>
	<li><b>Panel de creaci&oacute;n del efecto: </b>a
	continuaci&oacute;n nos aparecer&aacute; el siguiente panel:<img
		src="Effects_ShowText_files/ShowText_effect_ES.jpg"
		alt="SHOWTEXT EFFECT.JPG fail!" style="display: block; margin: 10px" />
</ul>
<p>En primer lugar se permite editar el color principal y el del
borde del texto a mostrar. Al usar cualquiera de los dos botones
relacionados con esta tarea, nos permite elegir la gama de colores,
mostrando la previsualizaci&oacute;n de como quedar&aacute; en el texto
<em>"Esta es una l&iacute;nea de prueba"</em>.</p>
<p>A continuaci&oacute;n se puede elegir una de las escenas
existentes en el cap&iacute;tulo, para poder realizar una
previsualizaci&oacute;n de como quedar&aacute; el texto en la escena. Al
igual que en otros efectos, la elecci&oacute;n de esta escena solo tiene
fines de previsualizaci&oacute;n, y no significa que el efecto est&eacute;
relacionado con la escena.</p>
<p>El texto introducido en este efecto se mostrar&aacute; en la
escena en la que se ejecute. M&aacute;s abajo se encuentra un campo de texto el
cual ser&aacute; rellenado con el texto que se desee mostrar. Se puede
elegir la posici&oacute;n del texto pinchando en la
previsualizaci&oacute;n de la escena en el punto deseado, o dando
valores a las coordenadas X e Y. En la posici&oacute;n elegida
aparecer&aacute; el texto introducido con los colores elegidos.</p>
</body>
</html>