<html>
  <head>
    <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
    <link rel="stylesheet" href="../../help.css" type="text/css">
    
  </head>
  <body>
    <img src="../logo-editor.png" alt="e-Adventure logo">
    

    <h1>
      Panel de condiciones
    </h1>
    <p>
      En el panel de condiciones se encontrar&#225; una primera parte que detalla 
      las condiciones que se est&#225;n editando. Luego hay una parte m&#225;s grande 
      donde se pueden editar las condiciones en s&#237;. Por &#250;ltimo, hay un bot&#243;n 
      para a&#241;adir nuevas condiciones y aceptar los cambios. 
      <br/>
      <img src="./Conditions_Panel_files/conditionsPanel1.png" style="margin-left: 10px; margin-bottom: 10px; display: block; margin-right: 10px; margin-top: 10px">
    </p>
    <h2>
      Parte superior: descripci&#243;n de la condici&#243;n
    </h2>
    <p>
      En esta parte del panel nos encontrarmos con una breve descripci&#243;n de a 
      que corresponde la condici&#243;n que estamos editando.
    </p>
    <h2>
      Parte inferior: a&#241;adir condiciones y aceptar cambios
    </h2>
    <p>
      En la parte inferior nos encontramos dos botones, por medio de los 
      cuales podemos a&#241;adir una nueva condici&#243;n o aceptar los cambios hechos a 
      las condiciones que estamos editando y cerrar la ventana.
    </p>
    <h2>
      El panel de edici&#243;n
    </h2>
    <p>
      En este panel encontramos una descripci&#243;n muy gr&#225;fica de la condici&#243;n 
      que estamos implementando. Cuando ponemos el rat&#243;n sobre una condici&#243;n, 
      tenemos la posiblidad de:
    </p>
    <ul>
      <li>
        <i>Eliminar</i>: Con este bot&#243;n quitamos la condici&#243;n.
      </li>
      <li>
        <i>Duplicar</i>: Con este bot&#243;n creamos una nueva condici&#243;n 
        exactamente igual a la actual y justo a continuaci&#243;n de esta unida por 
        un &quot;o bien&quot;.
      </li>
      <li>
        <i>Editar</i>: Este bot&#243;n nos permite editar el contenido de la 
        condici&#243;n. Podemos camibar tanto el elemento evaluado (de un flag a 
        otro o de un flag a una variable, etc.) o el valor con el que se 
        compara.
      </li>
      <li>
        Cuando ponemos el rat&#243;n sobre un &quot;nexo&quot;, tambi&#233;n podemos editar su 
        valor que puede cambiar entre <i>&quot;Y adem&#225;s&quot;</i> y <i>&quot;O 
        bien&quot;</i>. Las condiciones se agruparan autom&#225;ticamente de 
        acuerdo al significado que tienen en el lenguaje de e-Adventure.
      </li>
    </ul>
    <h3>
      Otras cosas...
    </h3>
    <p>
      Cuando a&#241;adimos una condici&#243;n, &#233;sta se a&#241;ade despu&#233;s de todas las 
      condiciones ya existentes. Si queremos a&#241;adir una condici&#243;n en medio, el 
      mejor procedimiento es elegir la condici&#243;n anterior al sitio donde 
      queremos que vaya la nueva, duplicarla y luego modificar el valor de la 
      nueva condici&#243;n creada.
    </p>
    <h3>
      Ver tambi&#233;n
    </h3>
    <p>
      <a href="./Conditions.html">Explicaci&#243;n general de las condiciones</a>
    </p>
  </body>
</html>
