<html>
  <head>
    <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
    <link rel="stylesheet" href="../../help.css" type="text/css">
    
  </head>
  <body>
    <img src="../logo-editor.png" alt="e-Adventure logo">
    

    <h1>
      Documentaci&#243;n
    </h1>
    <p>
      La documentaci&#243;n consiste en una serie de campos de texto. No todos los 
      elementos tienen la misma documentaci&#243;n y en cada uno se puede comportar 
      de manera distinta. Por ejemplo, los objetos mostrar&#225;n su nombre cuando 
      el jugador ponga el rat&#243;n sobre ellos en el juego, mostraran la 
      descripci&#243;n cuando el jugador haga un click y mostrar&#225;n la descripci&#243;n 
      detallada cuando el jugador pida examinarlo (si el comportamiento por 
      defecto no est&#225; modificado).
    </p>
    <h2>
      Nombre
    </h2>
    <p>
      No debe confundirse el nombre con el identificador. El nombre es 
      utilizado en el juego, no tiene por qu&#233; ser &#250;nico como el identificador, 
      y debe ser descriptivo. Adem&#225;s, el nombre a diferencia del identificador 
      pueden contener espacios. Por ej.: <i>Ordenador</i>
    </p>
    <h2>
      Descripci&#243;n
    </h2>
    <p>
      La descrpici&#243;n generalmente consiste en una linea con una explicaci&#243;n 
      breve del elemento. Cuando no es obligatorio rellenarla (estar&#225; indicado 
      en el panel) es porque no es utilizada en el motor y por lo tanto solo 
      es para documentar el elemento, muy &#250;til si en el desarrollo del juego 
      participan m&#225;s personas o se va a tener que modificar m&#225;s adelante. Por 
      ej.: <i>Esto es un ordenador</i>
    </p>
    <h2>
      Descripci&#243;n detallada
    </h2>
    <p>
      La descripci&#243;n detallada es simplemente una descripci&#243;n m&#225;s extensa. Hay 
      que tener en cuenta que en el juego esto puede ser dicho por el 
      personaje, y por lo tanto es recomendable que est&#233; escrito en el mismo 
      estilo que las conversaciones. Por ej.: <i>Es un ordenador, lo podr&#237;a 
      utilizar para buscar en internet pero no s&#233; si me lo prestar&#225;n...</i>
    </p>
  </body>
</html>
